In [2]:
import pandas as pd
dados = pd.read_csv(r'/home/youx/youxlab-treino-git/youxlab-treino-git/dados/venda-de-carros.csv')
dados

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

In [3]:
dados.head()

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00

In [6]:
dados.head(2)

  Fabricante       Cor  Quilometragem  Portas         Preco
0     Toyota    Branco         150043       4  R$ 24,000.00
1      Honda  Vermelho          87899       4  R$ 25,000.00

In [7]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Fabricante     10 non-null     object
 1   Cor            10 non-null     object
 2   Quilometragem  10 non-null     int64
 3   Portas         10 non-null     int64
 4   Preco          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [8]:
dados.shape

(10, 5)

In [9]:
type(dados)

pandas.core.frame.DataFrame

In [10]:
personagem_df = pd.DataFrame ({
    'nome' : ['Yharon','Calamitas','Stark'],
    'idade': ['100','100000','19'],
    'classe' : ['Bersek','Bruxa','Convergente']
})
personagem_df

        nome   idade       classe
0     Yharon     100       Bersek
1  Calamitas  100000        Bruxa
2      Stark      19  Convergente

In [11]:
personagem_df.columns

Index(['nome', 'idade', 'classe'], dtype='object')

In [12]:
lista_Personagem = list(personagem_df.columns)
lista_Personagem

['nome', 'idade', 'classe']

In [13]:
renoameado = personagem_df.rename(columns={
    'nome': 'Codenome',
})
renoameado

    Codenome   idade       classe
0     Yharon     100       Bersek
1  Calamitas  100000        Bruxa
2      Stark      19  Convergente

In [14]:
personagem_df.rename(columns={
    'nome':'codenome',
},inplace = True)
personagem_df

    codenome   idade       classe
0     Yharon     100       Bersek
1  Calamitas  100000        Bruxa
2      Stark      19  Convergente

In [15]:
personagem_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   codenome  3 non-null      object
 1   idade     3 non-null      object
 2   classe    3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [26]:
personagem_df.columns = ['rank','divida','grupo']
personagem_df

        rank  divida        grupo
0     Yharon     100       Bersek
1  Calamitas  100000        Bruxa
2      Stark      19  Convergente

In [27]:
print(dados['Fabricante'])
type(dados['Fabricante'])

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Fabricante, dtype: object

pandas.core.series.Series

In [28]:
dado = pd.Series([5,5.5,9,0])
dado

0    5.0
1    5.5
2    9.0
3    0.0
dtype: float64

In [29]:
cor_1 = dados['Cor'].copy
cor_1

<bound method NDFrame.copy of 0      Branco
1    Vermelho
2        Azul
3       Preto
4      Branco
5       Verde
6        Azul
7        Azul
8      Branco
9      Branco
Name: Cor, dtype: object>

In [30]:
print(dados)
dados.iloc[1]

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

Fabricante              Honda
Cor                  Vermelho
Quilometragem           87899
Portas                      4
Preco            R$ 25,000.00
Name: 1, dtype: object

In [31]:
print(dados)
dados.iloc[1:0]

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

Empty DataFrame
Columns: [Fabricante, Cor, Quilometragem, Portas, Preco]
Index: []

In [32]:
print(dados)
dados.iloc[1:3,2]

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

1    87899
2    32549
Name: Quilometragem, dtype: int64

In [33]:
del dados['Quilometragem']
dados

  Fabricante       Cor  Portas          Preco
0     Toyota    Branco       4   R$ 24,000.00
1      Honda  Vermelho       4   R$ 25,000.00
2     Toyota      Azul       3   R$ 27,000.00
3        BMW     Preto       5  R$ 122,000.00
4     Nissan    Branco       4   R$ 13,500.00
5     Toyota     Verde       4   R$ 14,500.00
6      Honda      Azul       4   R$ 17,500.00
7      Honda      Azul       4   R$ 27,000.00
8     Toyota    Branco       4   R$ 26,250.00
9     Nissan    Branco       4   R$ 19,700.00

In [34]:
dados['Fabricante'].unique()

array(['Toyota', 'Honda', 'BMW', 'Nissan'], dtype=object)

In [36]:
dados_filtrados = dados.query('Fabricante == "Honda"').reset_index()
dados_filtrados

   index Fabricante       Cor  Portas         Preco
0      1      Honda  Vermelho       4  R$ 25,000.00
1      6      Honda      Azul       4  R$ 17,500.00
2      7      Honda      Azul       4  R$ 27,000.00

In [37]:
dados_filtrados = dados.query('Fabricante == "Honda" and Cor == "Azul"').reset_index()
dados_filtrados

   index Fabricante   Cor  Portas         Preco
0      6      Honda  Azul       4  R$ 17,500.00
1      7      Honda  Azul       4  R$ 27,000.00

In [43]:
Lista_cor = ['Azul','Vermelho']
dados_filtrados1 = dados.query('Cor in @Lista_cor')
dados_filtrados1

  Fabricante       Cor  Portas         Preco
1      Honda  Vermelho       4  R$ 25,000.00
2     Toyota      Azul       3  R$ 27,000.00
6      Honda      Azul       4  R$ 17,500.00
7      Honda      Azul       4  R$ 27,000.00

In [16]:
dados['Preco'].describe

<bound method NDFrame.describe of 0     R$ 24,000.00
1     R$ 25,000.00
2     R$ 27,000.00
3    R$ 122,000.00
4     R$ 13,500.00
5     R$ 14,500.00
6     R$ 17,500.00
7     R$ 27,000.00
8     R$ 26,250.00
9     R$ 19,700.00
Name: Preco, dtype: object>

In [19]:
print(dados['Quilometragem'].max())
print(dados['Quilometragem'].min())
print(dados['Quilometragem'].sum())
print(dados['Quilometragem'].std())
print(dados['Quilometragem'].mean())

213095
11179
786014
61983.47173454119
78601.4

In [20]:
dados['Fabricante'].value_counts()

Fabricante
Toyota    4
Honda     3
Nissan    2
BMW       1
Name: count, dtype: int64

In [22]:
dados_marcas = dados['Fabricante'].value_counts().to_frame().reset_index()
dados_marcas

  Fabricante  count
0     Toyota      4
1      Honda      3
2     Nissan      2
3        BMW      1